Revit 2027 API
AssemblyInstance.CanRemoveElementsFromAssembly Method
 Identifies if provided assembly members can be removed from the assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanRemoveElementsFromAssembly(
	AssemblyInstance assemblyInstance,
	ICollection<ElementId> memberIds
)
Public Shared Function CanRemoveElementsFromAssembly (
	assemblyInstance As AssemblyInstance,
	memberIds As ICollection(Of ElementId)
) As Boolean
public:
static bool CanRemoveElementsFromAssembly(
	AssemblyInstance^ assemblyInstance,
	ICollection<ElementId^>^ memberIds
)
static member CanRemoveElementsFromAssembly :
        assemblyInstance : AssemblyInstance *
        memberIds : ICollection<ElementId> -> bool
Parameters
assemblyInstance AssemblyInstance
 The assembly instance to remove elements from.
memberIds ICollection<ElementId>
 Element ids to be tested for validity to remove from the assembly instance.
Return Value
Boolean
 True if all member ids are valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace